In [1]:
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [8]:
url='https://raw.githubusercontent.com/BigDataGal/Python-for-Data-Science/master/titanic-train.csv'

df = pd.read_csv(url)

In [10]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [12]:
def age(cols):
    pclass=cols[0]
    age=cols[1]
    
    if pd.isnull(age):
        if pclass ==1:
            return 37
        elif pclass==2:
            return 29
        else:
            return 24
    else:
        return age

In [13]:
df['Age']=df[['Pclass','Age']].apply(age,axis=1)

In [14]:
df.drop('Cabin',inplace=True,axis=1)

In [16]:
df.drop('PassengerId',inplace=True,axis=1)
df.drop('Name',inplace=True,axis=1)
df.drop('Ticket',inplace=True,axis=1)

In [28]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [20]:
df.dropna(inplace=True)

In [21]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [22]:
cat_feature_sex=df['Sex']

In [25]:
data1=pd.get_dummies(cat_feature_sex,drop_first=True)

In [30]:
cat_feature_embarked=df['Embarked']

In [32]:
data2=pd.get_dummies(cat_feature_embarked,drop_first=True)

In [33]:
data=pd.concat([df,data1,data2],axis=1)

In [34]:
data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked  male  Q  S
0         0       3    male  22.0      1      0   7.2500        S     1  0  1
1         1       1  female  38.0      1      0  71.2833        C     0  0  0
2         1       3  female  26.0      0      0   7.9250        S     0  0  1
3         1       1  female  35.0      1      0  53.1000        S     0  0  1
4         0       3    male  35.0      0      0   8.0500        S     1  0  1

In [36]:
data=data.drop('Sex',axis=1)

In [37]:
data=data.drop('Embarked',axis=1)

In [38]:
data.head()

   Survived  Pclass   Age  SibSp  Parch     Fare  male  Q  S
0         0       3  22.0      1      0   7.2500     1  0  1
1         1       1  38.0      1      0  71.2833     0  0  0
2         1       3  26.0      0      0   7.9250     0  0  1
3         1       1  35.0      1      0  53.1000     0  0  1
4         0       3  35.0      0      0   8.0500     1  0  1

In [39]:
from sklearn.model_selection import train_test_split

X=data.drop('Survived',axis=1)
y = data['Survived']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

In [40]:
from sklearn.tree import DecisionTreeClassifier

In [41]:
tree=DecisionTreeClassifier()

In [42]:
tree.fit(X_train,y_train)

DecisionTreeClassifier()

In [43]:
predict=tree.predict(X_test)

In [44]:
from sklearn.metrics import classification_report,confusion_matrix

In [45]:
print(classification_report(y_test,predict))

              precision    recall  f1-score   support

           0       0.82      0.81      0.81       167
           1       0.69      0.70      0.69       100

    accuracy                           0.77       267
   macro avg       0.75      0.75      0.75       267
weighted avg       0.77      0.77      0.77       267

In [46]:
print(confusion_matrix(y_test,predict))

[[135  32]
 [ 30  70]]